update readme and frontend package.json
